[
  {
    "id": "1",
    "slug": "spaghetti-carbonara-recipe",
    "title": "Classic Carbonara Recipe",
    "summary": "A creamy Roman pasta dish with eggs, pecorino romano, and guanciale.",
    "description": "A creamy Roman pasta dish made with eggs, pecorino romano, and guanciale.",
    "image": "https://images.unsplash.com/photo-1612874742237-6526221588e3?q=80&w=600&h=400&fit=crop",
    "category": "Italian",
    "cuisine": "Italian",
    "continent": "Europe",
    "dietary": [
      "Gluten Free Optional"
    ],
    "mealType": "Dinner",
    "audience": [
      "Couples"
    ],
    "country": "Italy",
    "prepTime": "20 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.8,
    "ratingCount": 42,
    "reviewCount": 42,
    "difficulty": "Medium",
    "servings": 2,
    "totalCalories": 650,
    "ingredients": [
      {
        "name": "Spaghetti",
        "amount": "200g",
        "calories": 310,
        "protein": "11g",
        "carbs": "62g",
        "fat": "1.5g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Guanciale",
        "amount": "100g",
        "calories": 250,
        "protein": "5g",
        "carbs": "0g",
        "fat": "25g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Large Eggs",
        "amount": "2",
        "calories": 140,
        "protein": "12g",
        "carbs": "1g",
        "fat": "10g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Pecorino Romano",
        "amount": "50g",
        "calories": 190,
        "protein": "13g",
        "carbs": "1g",
        "fat": "15g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Black Pepper",
        "amount": "1 tsp",
        "calories": 5,
        "protein": "0g",
        "carbs": "1g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Boil the Pasta Water",
        "text": "Fill a large pot with water and add a generous amount of salt, about 2 tablespoons. You want it to taste like the sea. Bring this to a rolling boil over high heat while you prep the other ingredients. The starchy pasta water is crucial for the sauce, so do not skip the salt."
      },
      {
        "step": 2,
        "title": "Crisp Up the Guanciale",
        "text": "Cut the guanciale into small cubes or strips, about half an inch thick. Add them to a cold skillet and turn the heat to medium. Let the fat render slowly for about 8 to 10 minutes until the pieces are golden and crispy but still have some chew. Do not rush this step as the rendered fat is pure flavor."
      },
      {
        "step": 3,
        "title": "Prepare the Egg Mixture",
        "text": "While the guanciale cooks, crack the eggs into a bowl and add the finely grated Pecorino Romano. Whisk everything together until smooth and creamy. Add a generous amount of freshly cracked black pepper. This mixture will become your silky sauce, so make sure there are no lumps."
      },
      {
        "step": 4,
        "title": "Cook the Spaghetti",
        "text": "Drop your spaghetti into the boiling water and cook until just al dente, about one minute less than the package directions. Before draining, save at least one cup of that starchy pasta water. You will need it to adjust the sauce consistency later."
      },
      {
        "step": 5,
        "title": "Bring It All Together",
        "text": "Transfer the hot pasta directly into the skillet with the guanciale. Toss everything together off the heat for about 30 seconds. Now here is the crucial part: remove the pan completely from the heat and let it cool for just a minute. Then pour in the egg mixture while tossing constantly. The residual heat will cook the eggs into a creamy sauce without scrambling. Add splashes of pasta water as needed until you achieve that glossy, coating consistency. Serve immediately with extra cheese and pepper on top."
      }
    ],
    "heritage": {
      "origin": "Carbonara emerged in Rome during the aftermath of World War II, when American soldiers brought bacon and eggs to Italy. Resourceful Roman cooks combined these with local pasta and Pecorino Romano cheese, creating what would become one of Italy's most beloved dishes. The name likely derives from carbonaro, meaning charcoal burner, suggesting origins as hearty food for mountain workers.",
      "facts": [
        "Traditional Carbonara contains absolutely no cream. The silkiness comes entirely from emulsified egg yolks, cheese, and starchy pasta water.",
        "Guanciale, cured pork jowl, is the only authentic meat for this dish. Bacon and pancetta are common substitutes but lack the same depth of flavor.",
        "The dish must be assembled off the heat to prevent the eggs from scrambling. Temperature control is everything.",
        "Romans use Pecorino Romano exclusively, never Parmesan. The sharper, saltier flavor is essential to authentic Carbonara."
      ],
      "tradition": "In Roman trattorias, Carbonara arrives at the table immediately after being tossed, while the sauce is still glossy and coating. It is always served with an extra generous crack of black pepper on top, and true Romans never ask for additional cheese because the ratio is already perfect."
    },
    "extra": []
  },
  {
    "id": "2",
    "slug": "avocado-toast-recipe",
    "title": "Garden Avocado Toast Recipe",
    "summary": "Simple breakfast with mashed avocado and poached egg.",
    "description": "Simple and delicious breakfast with mashed avocado and poached egg.",
    "image": "https://images.unsplash.com/photo-1525351484163-7529414344d8?q=80&w=600&h=400&fit=crop",
    "category": "Breakfast",
    "cuisine": "American",
    "continent": "America",
    "dietary": [
      "Vegetarian"
    ],
    "mealType": "Breakfast",
    "audience": [
      "Healthy"
    ],
    "country": "USA",
    "prepTime": "10 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.5,
    "ratingCount": 28,
    "reviewCount": 28,
    "difficulty": "Easy",
    "servings": 1,
    "totalCalories": 350,
    "ingredients": [
      {
        "name": "Sourdough Bread",
        "amount": "2 slices",
        "calories": 180,
        "protein": "6g",
        "carbs": "36g",
        "fat": "1g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Avocado",
        "amount": "1 large",
        "calories": 240,
        "protein": "3g",
        "carbs": "12g",
        "fat": "22g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Eggs",
        "amount": "2",
        "calories": 140,
        "protein": "12g",
        "carbs": "1g",
        "fat": "10g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Red Pepper Flakes",
        "amount": "pinch",
        "calories": 0,
        "protein": "0g",
        "carbs": "0g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Get Your Toast Ready",
        "text": "Slice your sourdough bread about three quarters of an inch thick. You want substantial slices that can hold up to the toppings. Toast them in a toaster or under the broiler until deeply golden brown with some charred spots. Good toast should have a satisfying crunch when you bite into it."
      },
      {
        "step": 2,
        "title": "Prepare the Avocado",
        "text": "Cut your avocado in half and remove the pit. Scoop the flesh into a bowl and add a good squeeze of fresh lemon juice, a pinch of flaky sea salt, and some freshly cracked black pepper. Mash it with a fork to your preferred consistency. Some like it smooth while others prefer it chunky with visible pieces."
      },
      {
        "step": 3,
        "title": "Poach the Eggs",
        "text": "Bring a pot of water to a gentle simmer and add a splash of white vinegar. Create a gentle whirlpool by stirring the water, then carefully crack each egg into the center. Let them cook undisturbed for about 3 minutes for a runny yolk. Use a slotted spoon to lift them out and drain on a paper towel."
      },
      {
        "step": 4,
        "title": "Build Your Toast",
        "text": "Spread a generous amount of the mashed avocado onto each slice of warm toast, going all the way to the edges. Gently place a poached egg on top of each one. Finish with another pinch of flaky salt, some red pepper flakes for heat, and maybe a drizzle of good olive oil. Serve immediately while everything is still warm."
      }
    ],
    "heritage": {
      "origin": "The avocado was first cultivated by the Aztecs in Mexico around 500 BCE, but modern avocado toast emerged from Australian cafe culture in the 1990s. Chef Bill Granger of Sydney's bills cafe is credited with popularizing smashed avocado on sourdough, which spread globally to become a breakfast icon.",
      "facts": [
        "The Aztecs called avocado 'ahuacatl' and prized it for its creamy texture and nutritional density long before it became a cafe staple.",
        "A perfectly ripe avocado should yield slightly when pressed but never feel mushy. The window of perfect ripeness lasts only about two days.",
        "Adding a splash of vinegar to your poaching water helps egg whites coagulate quickly, creating cleaner, rounder poached eggs.",
        "Sourdough is the traditional bread choice because its sturdy crumb structure holds up to heavy toppings without becoming soggy."
      ],
      "tradition": "The best avocado toast is assembled just before serving so the toast stays warm and crispy. Top with flaky sea salt like Maldon, a crack of pepper, and let the runny egg yolk become your sauce when you cut into it."
    },
    "extra": []
  },
  {
    "id": "3",
    "slug": "chicken-tikka-masala-recipe",
    "title": "Chicken Tikka Masala Recipe",
    "summary": "Smoky grilled chicken in a luxuriously creamy, spiced tomato sauce.",
    "description": "Experience the magic of this world-renowned dish, where tender, marinated chicken pieces are grilled to smoky perfection before being simmered in a luxuriously creamy, spiced tomato sauce. Bursting with the warmth of garam masala, ginger, and garlic, this authentic Chicken Tikka Masala offers a perfect balance of heat and comfort, bringing the vibrant flavors of India straight to your kitchen.",
    "image": "https://images.unsplash.com/photo-1565557623262-b51c2513a641?q=80&w=600&h=400&fit=crop",
    "category": "Indian",
    "cuisine": "Indian",
    "continent": "Asia",
    "dietary": [],
    "mealType": "Dinner",
    "audience": [
      "Family"
    ],
    "country": "India",
    "prepTime": "45 mins",
    "cookTime": "30 mins",
    "totalTime": "1 hr 15 mins",
    "rating": 4.9,
    "ratingCount": 54,
    "reviewCount": 54,
    "difficulty": "Hard",
    "servings": 4,
    "totalCalories": 550,
    "ingredients": [
      {
        "name": "Chicken Breast",
        "amount": "500g",
        "calories": 825,
        "protein": "155g",
        "carbs": "0g",
        "fat": "18g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "370mg"
      },
      {
        "name": "Yogurt",
        "amount": "200g",
        "calories": 120,
        "protein": "20g",
        "carbs": "7g",
        "fat": "2g",
        "fiber": "0g",
        "sugar": "7g",
        "sodium": "90mg"
      },
      {
        "name": "Tomato Puree",
        "amount": "400ml",
        "calories": 130,
        "protein": "4g",
        "carbs": "28g",
        "fat": "1g",
        "fiber": "4g",
        "sugar": "12g",
        "sodium": "20mg"
      },
      {
        "name": "Heavy Cream",
        "amount": "100ml",
        "calories": 340,
        "protein": "2g",
        "carbs": "3g",
        "fat": "37g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Marinate the Chicken",
        "text": "Cut your chicken breast into bite sized pieces, about two inches each. In a large bowl, combine yogurt, minced ginger, crushed garlic, garam masala, cumin, turmeric, and a good pinch of salt. Add the chicken and coat every piece thoroughly. Cover and refrigerate for at least 30 minutes, though overnight is even better for deeper flavor."
      },
      {
        "step": 2,
        "title": "Char the Chicken",
        "text": "Thread the marinated chicken onto skewers or spread them on a baking sheet. Cook under a hot broiler or on a grill for about 4 to 5 minutes per side until you get those beautiful charred spots and the chicken is cooked through. Set aside while you make the sauce. Those charred bits are essential for authentic flavor."
      },
      {
        "step": 3,
        "title": "Build the Masala Sauce",
        "text": "In a large pan over medium heat, add some oil and fry your onions until golden brown. Add fresh ginger and garlic, cooking until fragrant. Now add your spice blend and toast for about a minute until aromatic. Pour in the tomato puree and let it simmer for 15 to 20 minutes until the sauce darkens and the oil starts separating from the edges."
      },
      {
        "step": 4,
        "title": "Bring It Together",
        "text": "Reduce the heat to low and stir in the heavy cream until the sauce turns that beautiful orange color. Add your grilled chicken pieces and let everything simmer together for another 10 minutes so the flavors meld. Taste and adjust the seasoning. Garnish with fresh cilantro and serve with warm basmati rice and naan bread for scooping up every last bit of that incredible sauce."
      }
    ],
    "heritage": {
      "origin": "Legend credits Bangladeshi chef Ali Ahmed Aslam of Glasgow's Shish Mahal restaurant with inventing this dish in the 1970s when a customer complained his chicken tikka was too dry. He improvised a sauce with tomato, cream, and spices. Others trace its roots to Mughal court kitchens where grilled meats met creamy gravies centuries earlier.",
      "facts": [
        "In 2001, British Foreign Secretary Robin Cook declared Chicken Tikka Masala a 'true British national dish' for its perfect blend of British and Indian cultures.",
        "The word 'tikka' means small pieces in Hindi, referring to the bite sized chunks of marinated meat traditionally cooked in a tandoor oven.",
        "Yogurt in the marinade contains enzymes that naturally tenderize the chicken while infusing it with spices.",
        "The sauce is ready when the oil separates from the tomato base and floats at the edges of the pan."
      ],
      "tradition": "This dish is always served with steaming basmati rice and warm naan bread for scooping up the sauce. The chicken should be charred before adding to the gravy, providing essential smoky flavor and textural contrast against the creamy sauce."
    },
    "extra": []
  },
  {
    "id": "4",
    "slug": "green-smoothie-bowl-recipe",
    "title": "Energy Smoothie Bowl Recipe",
    "summary": "Nutritious bowl with spinach, berries, and chia seeds.",
    "description": "Nutritious bowl packed with spinach, berries, and chia seeds.",
    "image": "https://images.unsplash.com/photo-1512621776951-a57141f2eefd?q=80&w=600&h=400&fit=crop",
    "category": "Vegan",
    "cuisine": "Modern",
    "continent": "Global",
    "dietary": [
      "Vegan",
      "Gluten Free"
    ],
    "mealType": "Breakfast",
    "audience": [
      "Healthy",
      "Kids"
    ],
    "country": "Global",
    "prepTime": "15 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.7,
    "ratingCount": 19,
    "reviewCount": 19,
    "difficulty": "Easy",
    "servings": 2,
    "totalCalories": 280,
    "ingredients": [
      {
        "name": "Spinach",
        "amount": "2 cups",
        "calories": 15,
        "protein": "2g",
        "carbs": "2g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Banana",
        "amount": "1",
        "calories": 105,
        "protein": "1g",
        "carbs": "27g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Frozen Berries",
        "amount": "1 cup",
        "calories": 70,
        "protein": "1g",
        "carbs": "18g",
        "fat": "1g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Almond Milk",
        "amount": "1 cup",
        "calories": 30,
        "protein": "1g",
        "carbs": "1g",
        "fat": "3g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Prep Your Ingredients",
        "text": "Make sure your banana is frozen and your berries are cold or frozen as well. This is what gives the smoothie bowl that thick, ice cream like consistency. If you use room temperature fruit, you will end up with a thin smoothie instead of a scoopable bowl."
      },
      {
        "step": 2,
        "title": "Blend Until Thick",
        "text": "Add the frozen banana, berries, spinach, and just enough almond milk to get things moving. Start with half a cup and add more only if needed. Blend on high, using the tamper to push ingredients down if you have one. The mixture should be very thick and not pourable. This takes about 60 to 90 seconds of blending."
      },
      {
        "step": 3,
        "title": "Build Your Bowl",
        "text": "Pour the thick smoothie into a bowl and smooth the top with a spoon. Now comes the fun part. Arrange your toppings in sections or rows for that Instagram worthy look. Add a handful of crunchy granola, some fresh berries, sliced banana, a sprinkle of chia seeds, and a drizzle of honey or nut butter. Eat immediately before it starts to melt."
      }
    ],
    "heritage": {
      "origin": "The smoothie bowl traces back to Brazilian acai bowls, where Amazonian acai berries were blended into thick frozen purees by surfers and athletes in Rio de Janeiro. The concept traveled to Hawaii in the early 2000s, gaining tropical additions before spreading to California and eventually becoming a global breakfast phenomenon.",
      "facts": [
        "The key difference from a regular smoothie is texture. Using frozen fruit and minimal liquid creates a thick, scoopable consistency similar to soft serve ice cream.",
        "Adding spinach turns your bowl green but remains undetectable in taste, making it perfect for sneaking vegetables into breakfast.",
        "Chia seeds absorb liquid and create a gel texture over time, so add them right before eating for maximum crunch.",
        "The bowl concept transforms rushed breakfast into mindful eating, encouraging you to slow down and savor each spoonful."
      ],
      "tradition": "Build your bowl with intention, arranging toppings artfully before eating. The ritual is as important as the nutrition, creating something almost too beautiful to eat before you dig in with your spoon."
    },
    "extra": []
  },
  {
    "id": "5",
    "slug": "beef-tacos-recipe",
    "title": "Street Style Beef Tacos Recipe",
    "summary": "Authentic tacos with cilantro, onions, and spicy salsa.",
    "description": "Authentic tacos with cilantro, onions, and spicy salsa.",
    "image": "https://images.unsplash.com/photo-1552332386-f8dd00dc2f85?q=80&w=600&h=400&fit=crop",
    "category": "Mexican",
    "cuisine": "Mexican",
    "continent": "America",
    "dietary": [],
    "mealType": "Lunch",
    "audience": [
      "Party"
    ],
    "country": "Mexico",
    "prepTime": "30 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.6,
    "ratingCount": 35,
    "reviewCount": 35,
    "difficulty": "Medium",
    "servings": 4,
    "totalCalories": 480,
    "ingredients": [
      {
        "name": "Ground Beef",
        "amount": "500g",
        "calories": 1250,
        "protein": "130g",
        "carbs": "0g",
        "fat": "80g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Corn Tortillas",
        "amount": "12",
        "calories": 600,
        "protein": "12g",
        "carbs": "120g",
        "fat": "6g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Onion",
        "amount": "1",
        "calories": 40,
        "protein": "1g",
        "carbs": "9g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Cilantro",
        "amount": "1 bunch",
        "calories": 5,
        "protein": "0g",
        "carbs": "1g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Season and Cook the Beef",
        "text": "Heat a large skillet or cast iron pan over high heat until smoking hot. Add the ground beef and break it up with a wooden spoon. Season generously with cumin, dried oregano, garlic powder, chili powder, and salt. Let it cook without stirring for a minute or two to develop those crispy browned bits. Then stir and repeat until the meat is cooked through with plenty of caramelized edges."
      },
      {
        "step": 2,
        "title": "Warm Your Tortillas",
        "text": "While the beef rests, heat a dry skillet over medium high heat. Warm each corn tortilla for about 30 seconds per side until soft and pliable with a few charred spots. Stack two tortillas together for each taco, this is the authentic street style way and prevents them from falling apart when loaded with toppings."
      },
      {
        "step": 3,
        "title": "Prep Your Toppings",
        "text": "Finely dice your white onion and roughly chop a good handful of fresh cilantro. Cut some limes into wedges. If you have salsa verde or salsa roja, put them in small bowls. Having everything ready to go makes assembly quick and keeps the tacos warm when you serve them."
      },
      {
        "step": 4,
        "title": "Assemble and Serve",
        "text": "Spoon the seasoned beef onto your warm double stacked tortillas. Top with the diced onion and fresh cilantro. Squeeze a lime wedge over each taco and add your salsa of choice. Serve immediately while everything is still hot. These are meant to be eaten with your hands, standing up if you want the true street food experience."
      }
    ],
    "heritage": {
      "origin": "The taco's concept dates to pre Columbian times when Aztecs filled tortillas with fish and proteins. The word 'taco' emerged from 18th century Mexican silver mines where it described paper wrapped gunpowder charges, later adopted for the portable food format miners ate with one hand while working.",
      "facts": [
        "Authentic street vendors stack two small tortillas together for structural integrity since meat juices soak into the corn and can cause a single tortilla to fall apart.",
        "The best taco meat gets chopped directly on the hot plancha, mixing crispy caramelized edges throughout the tender centers.",
        "Traditional taco seasonings include cumin, dried oregano, garlic, and dried chilies, applied generously but never masking the natural beef flavor.",
        "In Mexico City, taquerias stay open late into the night, serving everyone from factory workers to businesspeople in democratic queues."
      ],
      "tradition": "Street tacos are meant to be eaten standing, with the simple toppings of raw white onion, fresh cilantro, a squeeze of lime, and your choice of salsa verde or roja. Nothing more is needed."
    },
    "extra": []
  },
  {
    "id": "6",
    "slug": "miso-ramen-recipe",
    "title": "Hearty Miso Ramen Recipe",
    "summary": "Traditional Japanese soup with noodles, bamboo shoots, and nori.",
    "description": "Traditional Japanese soup with noodles, bamboo shoots, and nori.",
    "image": "https://images.unsplash.com/photo-1569718212165-3a8278d5f624?q=80&w=600&h=400&fit=crop",
    "category": "Japanese",
    "cuisine": "Japanese",
    "continent": "Asia",
    "dietary": [],
    "mealType": "Dinner",
    "audience": [
      "Foodies"
    ],
    "country": "Japan",
    "prepTime": "40 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.9,
    "ratingCount": 61,
    "reviewCount": 61,
    "difficulty": "Hard",
    "servings": 2,
    "totalCalories": 600,
    "ingredients": [
      {
        "name": "Ramen Noodles",
        "amount": "200g",
        "calories": 300,
        "protein": "10g",
        "carbs": "60g",
        "fat": "2g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Miso Paste",
        "amount": "4 tbsp",
        "calories": 140,
        "protein": "8g",
        "carbs": "20g",
        "fat": "4g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Soft Boiled Egg",
        "amount": "1",
        "calories": 70,
        "protein": "6g",
        "carbs": "1g",
        "fat": "5g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Pork Belly",
        "amount": "100g",
        "calories": 500,
        "protein": "10g",
        "carbs": "0g",
        "fat": "50g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Build Your Broth",
        "text": "Heat your dashi or chicken stock in a large pot over medium heat until it starts to simmer. Do not let it boil. In a small bowl, take a ladle of the hot broth and whisk in the miso paste until completely dissolved. This prevents lumps. Pour this mixture back into the pot and stir gently. Keep warm but do not boil or you will lose the delicate miso flavor."
      },
      {
        "step": 2,
        "title": "Prepare Your Toppings",
        "text": "Slice your chashu pork belly into thin rounds. If your soft boiled eggs are marinated, cut them in half to reveal those jammy golden yolks. Slice your nori sheets and gather your corn, bamboo shoots, and green onions. Having everything ready before you cook the noodles is essential since ramen must be served immediately."
      },
      {
        "step": 3,
        "title": "Cook the Noodles",
        "text": "Bring a separate pot of water to a rolling boil. Add your fresh or dried ramen noodles and cook according to package directions, usually about 2 to 3 minutes for fresh noodles. They should be just barely cooked since they will continue to soften in the hot broth. Drain well and shake off excess water."
      },
      {
        "step": 4,
        "title": "Assemble the Bowl",
        "text": "Place the hot noodles in a deep bowl. Ladle the warm miso broth around them, not directly on top. Now arrange your toppings artfully: the chashu pork on one side, the halved egg next to it, a small mound of corn, some bamboo shoots, and a sheet of nori tucked against the side of the bowl. Finish with sliced green onions and a pat of butter if you like. Serve immediately and eat while piping hot."
      }
    ],
    "heritage": {
      "origin": "Ramen arrived in Japan through Chinese immigrants in Yokohama during the late 1800s. Miso ramen specifically was invented in 1955 at Aji no Sanpei restaurant in Sapporo, Hokkaido, where chef Morito Omori created a soup hearty enough to stand up to brutal northern winters.",
      "facts": [
        "Different miso types create different ramens. White miso is sweeter and milder, red miso is saltier and more pungent. Most shops blend them for complexity.",
        "Traditional toppings each serve a purpose: chashu for richness, soft boiled egg for creaminess, nori for crunch, and menma bamboo shoots for fermented tang.",
        "Hokkaido style miso ramen traditionally includes a pat of butter and sweet corn, ingredients unique to that northern region.",
        "The broth layers umami from multiple sources: fermented miso, dashi from kombu and bonito, and tonkotsu pork bone stock."
      ],
      "tradition": "In Japan, ramen is meant to be eaten quickly while still piping hot, slurping the noodles to cool them and aerate the broth. The bowl arrives assembled with artful precision, and you should start eating immediately."
    },
    "extra": []
  },
  {
    "id": "7",
    "slug": "quinoa-salad-recipe",
    "title": "Mediterranean Quinoa Salad Recipe",
    "summary": "Refreshing salad with cucumbers, tomatoes, and kalamata olives.",
    "description": "Refreshing salad with cucumbers, tomatoes, and kalamata olives.",
    "image": "https://images.unsplash.com/photo-1540189549336-e6e99c3679fe?q=80&w=600&h=400&fit=crop",
    "category": "Salads",
    "cuisine": "Greek",
    "continent": "Europe",
    "dietary": [
      "Vegan",
      "Gluten Free"
    ],
    "mealType": "Lunch",
    "audience": [
      "Healthy"
    ],
    "country": "Greece",
    "prepTime": "15 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.4,
    "ratingCount": 12,
    "reviewCount": 12,
    "difficulty": "Easy",
    "servings": 4,
    "totalCalories": 320,
    "ingredients": [
      {
        "name": "Quinoa",
        "amount": "1 cup",
        "calories": 220,
        "protein": "8g",
        "carbs": "39g",
        "fat": "4g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Cucumber",
        "amount": "1",
        "calories": 30,
        "protein": "2g",
        "carbs": "6g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Cherry Tomatoes",
        "amount": "1 cup",
        "calories": 30,
        "protein": "1g",
        "carbs": "6g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Feta Cheese",
        "amount": "50g",
        "calories": 130,
        "protein": "7g",
        "carbs": "2g",
        "fat": "10g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Cook the Quinoa",
        "text": "Rinse your quinoa under cold water for about 30 seconds to remove any bitterness. Add it to a pot with twice the amount of water or vegetable broth for extra flavor. Bring to a boil, then reduce heat and simmer covered for 15 minutes. Remove from heat and let it steam with the lid on for 5 more minutes. Fluff with a fork and spread on a baking sheet to cool quickly."
      },
      {
        "step": 2,
        "title": "Prepare the Vegetables",
        "text": "While the quinoa cools, dice your cucumber into small cubes, about half an inch. Halve the cherry tomatoes or quarter them if they are large. Thinly slice some red onion and rough chop your fresh herbs like parsley and mint. Crumble the feta cheese and pit the olives if they are not already pitted."
      },
      {
        "step": 3,
        "title": "Make the Dressing",
        "text": "In a small bowl or jar, whisk together good quality extra virgin olive oil, fresh lemon juice, a splash of red wine vinegar, minced garlic, salt, and pepper. Taste and adjust the acidity and seasoning. The dressing should be bright and punchy since it needs to season all that quinoa and vegetables."
      },
      {
        "step": 4,
        "title": "Bring It All Together",
        "text": "Add the cooled quinoa to a large bowl with all the chopped vegetables, olives, and herbs. Pour the dressing over everything and toss gently but thoroughly. Add the crumbled feta and give it one more gentle toss. Let it sit for at least 15 minutes before serving so the flavors can marry. This salad tastes even better the next day after everything has had time to meld together."
      }
    ],
    "heritage": {
      "origin": "Quinoa was sacred to the Incas who cultivated it for over 5,000 years in the Andes, calling it 'chisaya mama' or mother of all grains. This salad bridges that ancient tradition with Mediterranean cuisine, recognized by UNESCO as an Intangible Cultural Heritage for promoting longevity and heart health.",
      "facts": [
        "Unlike most grains, quinoa is a complete protein containing all nine essential amino acids, making this salad a full meal.",
        "Authentic Kalamata olives from Greece's Peloponnese are protected by EU designation, ensuring their distinctive purple black color and meaty texture.",
        "Traditional feta must be made from sheep's milk or a blend with goat's milk. Its tangy, crumbly character cannot be replicated by cow's milk versions.",
        "The salad actually improves as it sits, making it perfect for meal prep and picnics."
      ],
      "tradition": "Mediterranean eating philosophy means letting quality ingredients speak for themselves without heavy sauces. Dress simply with excellent olive oil and lemon juice, add fresh herbs, and enjoy at room temperature for best flavor."
    },
    "extra": []
  },
  {
    "id": "8",
    "slug": "lentil-soup-recipe",
    "title": "Spiced Lentil Soup Recipe",
    "summary": "Warm and comforting soup filled with protein-rich lentils.",
    "description": "Warm and comforting soup filled with protein-rich lentils.",
    "image": "https://images.unsplash.com/photo-1547592166-23ac45744acd?q=80&w=600&h=400&fit=crop",
    "category": "Soups",
    "cuisine": "Turkish",
    "continent": "Asia",
    "dietary": [
      "Vegan"
    ],
    "mealType": "Lunch",
    "audience": [
      "Kids",
      "Elderly"
    ],
    "country": "Turkey",
    "prepTime": "35 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.5,
    "ratingCount": 24,
    "reviewCount": 24,
    "difficulty": "Medium",
    "servings": 4,
    "totalCalories": 290,
    "ingredients": [
      {
        "name": "Red Lentils",
        "amount": "1 cup",
        "calories": 230,
        "protein": "18g",
        "carbs": "40g",
        "fat": "1g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Carrots",
        "amount": "2",
        "calories": 60,
        "protein": "1g",
        "carbs": "14g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Onion",
        "amount": "1",
        "calories": 40,
        "protein": "1g",
        "carbs": "9g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Cumin",
        "amount": "1 tsp",
        "calories": 10,
        "protein": "0g",
        "carbs": "1g",
        "fat": "1g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Build Your Aromatics",
        "text": "Dice your onion and carrots into small pieces. Heat a generous amount of olive oil or butter in a large pot over medium heat. Add the vegetables and cook, stirring occasionally, for about 8 to 10 minutes until they are soft and starting to turn golden. Add your cumin and stir for another minute until fragrant."
      },
      {
        "step": 2,
        "title": "Add Lentils and Simmer",
        "text": "Add the red lentils to the pot along with your vegetable stock or water. You want about 4 cups of liquid for every cup of lentils. Bring everything to a boil, then reduce the heat to low. Let it simmer uncovered for about 20 to 25 minutes, stirring occasionally. The lentils should break down completely and the soup will thicken naturally."
      },
      {
        "step": 3,
        "title": "Blend and Season",
        "text": "Use an immersion blender to puree the soup until smooth, or leave it slightly chunky if you prefer texture. Taste and season generously with salt and pepper. Add a good pinch of dried mint if you have it. The soup will thicken as it sits, so add more water or stock if needed to reach your desired consistency."
      },
      {
        "step": 4,
        "title": "Finish and Serve",
        "text": "Ladle the hot soup into bowls. Squeeze fresh lemon juice over each serving, this is essential and transforms the entire dish. If you want to be traditional, drizzle some butter that has been sizzled with red pepper flakes over the top. Serve with crusty bread for dipping and eat while piping hot."
      }
    ],
    "heritage": {
      "origin": "Called mercimek corbasi in Turkey, this soup opens nearly every meal in Turkish lokantas from Istanbul to the smallest Anatolian village. Lentils were cultivated in the Fertile Crescent over 8,000 years ago, making them one of humanity's oldest crops, referenced in the Hebrew Bible, Greek poetry, and Roman texts.",
      "facts": [
        "Red lentils cook in under 30 minutes without soaking and dissolve completely into a naturally creamy puree, no dairy required.",
        "Cumin is the essential spice that gives Turkish lentil soup its characteristic warmth and earthiness.",
        "A squeeze of lemon juice at the table transforms the soup, cutting through the earthiness and brightening every spoonful.",
        "In southeastern Turkey near Syria, cooks add pomegranate molasses for sweet and sour complexity."
      ],
      "tradition": "Many Turkish families finish the soup with a drizzle of butter infused with pul biber red pepper flakes, which melts into orange pools on the surface. Always serve with crusty bread for dipping."
    },
    "extra": []
  },
  {
    "id": "9",
    "slug": "blueberry-pancakes-recipe",
    "title": "Fluffy Blueberry Pancakes Recipe",
    "summary": "Perfect weekend breakfast with fresh blueberries and maple syrup.",
    "description": "Perfect weekend breakfast with fresh blueberries and maple syrup.",
    "image": "https://images.unsplash.com/photo-1528207776546-365bb710ee93?q=80&w=600&h=400&fit=crop",
    "category": "Breakfast",
    "cuisine": "American",
    "continent": "America",
    "dietary": [
      "Vegetarian"
    ],
    "mealType": "Brunch",
    "audience": [
      "Kids"
    ],
    "country": "USA",
    "prepTime": "25 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.8,
    "ratingCount": 47,
    "reviewCount": 47,
    "difficulty": "Medium",
    "servings": 4,
    "totalCalories": 450,
    "ingredients": [
      {
        "name": "Flour",
        "amount": "1.5 cups",
        "calories": 500,
        "protein": "15g",
        "carbs": "110g",
        "fat": "1g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Milk",
        "amount": "1 cup",
        "calories": 100,
        "protein": "8g",
        "carbs": "12g",
        "fat": "2g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Blueberries",
        "amount": "1 cup",
        "calories": 85,
        "protein": "1g",
        "carbs": "21g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Butter",
        "amount": "2 tbsp",
        "calories": 200,
        "protein": "0g",
        "carbs": "0g",
        "fat": "22g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Make the Batter",
        "text": "In a large bowl, whisk together the flour, sugar, baking powder, and a pinch of salt. In a separate bowl, combine the milk, melted butter, and egg. Pour the wet ingredients into the dry and stir gently until just combined. A few lumps are perfectly fine and actually desirable. Overmixing will make your pancakes tough instead of fluffy."
      },
      {
        "step": 2,
        "title": "Add the Blueberries",
        "text": "Gently fold the fresh blueberries into the batter using a spatula. Do not stir too vigorously or you will crush the berries and turn your batter purple. Alternatively, you can drop blueberries directly onto each pancake on the griddle for more even distribution and prettier presentation."
      },
      {
        "step": 3,
        "title": "Heat Your Griddle",
        "text": "Heat a griddle or large nonstick pan over medium heat. Test if it is ready by sprinkling a few drops of water on the surface. They should sizzle and evaporate immediately. Lightly grease with butter or cooking spray. The right temperature is crucial for even browning."
      },
      {
        "step": 4,
        "title": "Cook the Pancakes",
        "text": "Pour about a quarter cup of batter for each pancake. Let them cook undisturbed until you see bubbles forming on the surface and the edges start to look set, about 2 to 3 minutes. Flip carefully and cook for another minute or two until golden brown on both sides. Keep finished pancakes warm in a low oven while you cook the rest."
      },
      {
        "step": 5,
        "title": "Serve It Up",
        "text": "Stack your pancakes high on a plate. Add a generous pat of butter on top so it melts down the sides. Drizzle with real maple syrup and maybe add some extra fresh blueberries on the side. Dust with powdered sugar if you are feeling fancy. Serve immediately while everything is still warm and the butter is still melting."
      }
    ],
    "heritage": {
      "origin": "Pancakes trace back to ancient Greece and Rome, but the fluffy American version emerged in the late 1800s when baking powder became widely available. Native Americans in Maine called wild blueberries 'star berries' and mixed them with cornmeal for cakes cooked over fires, the earliest blueberry pancakes.",
      "facts": [
        "The secret to fluffy pancakes is avoiding overmixing. A few lumps in the batter are not just acceptable but desirable since overmixing develops gluten and makes them tough.",
        "Native Americans used blueberries as both food and medicine, drying them for winter storage in everything from soups to pemmican.",
        "Maine produces the vast majority of wild blueberries in the United States, and the state's breakfast menus prominently feature this local treasure.",
        "Real maple syrup from Vermont or Quebec contains no corn syrup and has a complexity that imitations simply cannot match."
      ],
      "tradition": "Fold blueberries gently into the batter at the very end, or drop them onto the raw side of each pancake just before flipping. Serve immediately with butter melting into golden pools and genuine maple syrup."
    },
    "extra": []
  },
  {
    "id": "10",
    "slug": "lemon-herb-salmon-recipe",
    "title": "Lemon Herb Salmon Recipe",
    "summary": "Fresh salmon fillets grilled to perfection with a zesty lemon and herb butter.",
    "description": "Fresh salmon fillets grilled to perfection with a zesty lemon and herb butter.",
    "image": "https://images.unsplash.com/photo-1467003909585-2f8a72700288?q=80&w=600&h=400&fit=crop",
    "category": "Seafood",
    "cuisine": "Modern",
    "continent": "Global",
    "dietary": [
      "Gluten Free"
    ],
    "mealType": "Dinner",
    "audience": [
      "Health Conscious"
    ],
    "country": "Global",
    "prepTime": "20 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.7,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Medium",
    "servings": 2,
    "totalCalories": 400,
    "ingredients": [
      {
        "name": "Salmon Fillet",
        "amount": "200g",
        "calories": 415,
        "protein": "45g",
        "carbs": "0g",
        "fat": "25g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Lemon",
        "amount": "1",
        "calories": 20,
        "protein": "1g",
        "carbs": "9g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Butter",
        "amount": "20g",
        "calories": 145,
        "protein": "0g",
        "carbs": "0g",
        "fat": "16g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Fresh Dill",
        "amount": "small bunch",
        "calories": 5,
        "protein": "0g",
        "carbs": "1g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Make the Herb Butter",
        "text": "Let your butter soften at room temperature for about 30 minutes. Mix it with the zest of one lemon, a tablespoon of chopped fresh dill, a pinch of salt, and some freshly cracked black pepper. Mash everything together with a fork until well combined. You can roll this into a log in plastic wrap and refrigerate until firm if you want nice slices."
      },
      {
        "step": 2,
        "title": "Prep the Salmon",
        "text": "Take your salmon fillets out of the fridge about 15 minutes before cooking so they come to room temperature. This helps them cook more evenly. Pat them completely dry with paper towels, then season generously on both sides with salt and pepper. The skin side should be especially dry if you want it crispy."
      },
      {
        "step": 3,
        "title": "Cook the Salmon",
        "text": "Heat a grill or cast iron pan to medium high heat. If using a pan, add a drizzle of oil. Place the salmon skin side down if it has skin. Let it cook without moving for about 4 to 5 minutes until the skin is crispy and releases easily. Flip and cook for another 3 to 4 minutes until the fish is just cooked through but still slightly pink in the center."
      },
      {
        "step": 4,
        "title": "Finish and Serve",
        "text": "Transfer the salmon to plates immediately. While the fish is still hot, place a generous slice of that herb butter right on top. Watch it melt into a glossy, aromatic sauce. Scatter some extra fresh dill over the top, add a lemon wedge on the side for squeezing, and serve right away. The fish will continue to cook slightly from residual heat, so do not delay."
      }
    ],
    "heritage": {
      "origin": "Pacific Northwest indigenous peoples built civilizations around annual salmon runs, smoking and drying fish for winter survival. In Viking age Scandinavia, salmon was so valuable it served as currency. This preparation draws from French and Italian coastal traditions where simplicity lets quality ingredients shine.",
      "facts": [
        "Salmon is best cooked to medium, still slightly translucent in the center. Pull it from heat at 125 degrees Fahrenheit and let carryover cooking finish the job.",
        "Dill's anise like brightness is the classic Scandinavian pairing with salmon, though tarragon, thyme, and oregano all work beautifully.",
        "Using lemon zest in compound butter provides bright citrus flavor without the acidity of juice, which can make fish mushy if applied too early.",
        "The French culinary principle 'respect the ingredient' applies nowhere more than with fresh salmon. Your main job is simply not to overcook it."
      ],
      "tradition": "Compound butter, mixed with lemon zest and fresh herbs, melts slowly over the warm fillet to create a silky, restaurant quality sauce. Add a squeeze of fresh lemon only at the table, just before eating."
    },
    "extra": []
  },
  {
    "id": "11",
    "slug": "thai-green-curry-recipe",
    "title": "Thai Green Curry Recipe",
    "summary": "A fragrant and spicy curry with coconut milk, bamboo shoots, and basil.",
    "description": "A fragrant and spicy curry with coconut milk, bamboo shoots, and basil.",
    "image": "https://images.unsplash.com/photo-1455619452474-d2be8b1e70cd?q=80&w=600&h=400&fit=crop",
    "category": "Thai",
    "cuisine": "Thai",
    "continent": "Asia",
    "dietary": [
      "Gluten Free"
    ],
    "mealType": "Dinner",
    "audience": [
      "Spice Lovers"
    ],
    "country": "Thailand",
    "prepTime": "35 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.9,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Hard",
    "servings": 3,
    "totalCalories": 520,
    "ingredients": [
      {
        "name": "Coconut Milk",
        "amount": "400ml",
        "calories": 700,
        "protein": "4g",
        "carbs": "12g",
        "fat": "70g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Green Curry Paste",
        "amount": "2 tbsp",
        "calories": 50,
        "protein": "1g",
        "carbs": "8g",
        "fat": "2g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Chicken Breast",
        "amount": "300g",
        "calories": 495,
        "protein": "93g",
        "carbs": "0g",
        "fat": "11g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Bamboo Shoots",
        "amount": "1 cup",
        "calories": 40,
        "protein": "4g",
        "carbs": "8g",
        "fat": "0.5g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Toast the Curry Paste",
        "text": "Open your can of coconut milk without shaking it. Scoop out the thick cream that has risen to the top, about half a cup. Heat this in a wok or large pan over medium high heat. Add your green curry paste and fry it in the coconut cream for 2 to 3 minutes, stirring constantly. You will see the oils start to separate and smell the incredible aroma released as the spices bloom."
      },
      {
        "step": 2,
        "title": "Add Chicken and Coconut Milk",
        "text": "Add your sliced chicken breast to the pan and stir to coat it with the fragrant paste. Cook for about 3 minutes until the chicken is sealed on all sides. Now pour in the rest of your coconut milk and stir everything together. Add a splash of fish sauce for that essential umami depth and a pinch of palm sugar or brown sugar to balance the heat."
      },
      {
        "step": 3,
        "title": "Simmer Until Tender",
        "text": "Let the curry simmer gently for about 10 to 15 minutes until the chicken is cooked through and tender. Do not let it boil vigorously or the coconut milk may separate. The sauce should be rich and creamy, coating the back of a spoon. Taste and adjust the seasoning, adding more fish sauce or sugar as needed."
      },
      {
        "step": 4,
        "title": "Add Vegetables and Finish",
        "text": "Add your bamboo shoots and any other vegetables you like, such as Thai eggplant or bell peppers. Cook for another 3 to 4 minutes until just tender. Remove from heat and stir in a generous handful of fresh Thai basil leaves. The residual heat will wilt them perfectly. Serve immediately over steamed jasmine rice, spooning plenty of that aromatic coconut sauce over the top."
      }
    ],
    "heritage": {
      "origin": "Thai green curry, or gaeng khiao wan meaning 'sweet green curry,' originated in the royal courts of the Ayutthaya Kingdom where specialized cooks developed intricate recipes over generations. The techniques eventually spread from palaces to street stalls and family kitchens across Thailand.",
      "facts": [
        "Traditional curry paste is pounded in a granite mortar called a krok for 15 to 20 minutes. Food processors incorporate air and fail to fully release the essential oils.",
        "Cilantro roots, often discarded in Western cooking, provide an earthy depth essential to authentic Thai curry paste.",
        "The curry must be fried in coconut cream first, allowing the oils to separate and the spices to bloom before adding more liquid.",
        "Thai basil should be added at the very end to preserve its bright anise flavor and prevent the leaves from turning black."
      ],
      "tradition": "Always serve over perfectly steamed jasmine rice that absorbs the fragrant sauce. The rice provides a neutral contrast to the intense spice and creamy coconut, balancing each bite."
    },
    "extra": []
  },
  {
    "id": "12",
    "slug": "margherita-pizza-recipe",
    "title": "Classic Margherita Recipe",
    "summary": "Simple and elegant pizza with tomato sauce, fresh mozzarella, and basil.",
    "description": "Simple and elegant pizza with tomato sauce, fresh mozzarella, and basil.",
    "image": "https://images.unsplash.com/photo-1604068549290-dea0e4a305ca?q=80&w=600&h=400&fit=crop",
    "category": "Italian",
    "cuisine": "Italian",
    "continent": "Europe",
    "dietary": [
      "Vegetarian"
    ],
    "mealType": "Dinner",
    "audience": [
      "Families"
    ],
    "country": "Italy",
    "prepTime": "25 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.9,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Medium",
    "servings": 2,
    "totalCalories": 800,
    "ingredients": [
      {
        "name": "Pizza Dough",
        "amount": "250g",
        "calories": 600,
        "protein": "18g",
        "carbs": "120g",
        "fat": "4g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Tomato Sauce",
        "amount": "1/2 cup",
        "calories": 80,
        "protein": "2g",
        "carbs": "16g",
        "fat": "1g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Fresh Mozzarella",
        "amount": "125g",
        "calories": 300,
        "protein": "22g",
        "carbs": "4g",
        "fat": "22g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Basil",
        "amount": "handful",
        "calories": 5,
        "protein": "0g",
        "carbs": "1g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Preheat Your Oven",
        "text": "Turn your oven to its highest setting, ideally 500 degrees Fahrenheit or higher. If you have a pizza stone, place it in the oven now and let it heat for at least 30 minutes. The stone stores heat and helps create that crispy bottom crust. A hot oven is the closest most home cooks can get to a traditional wood fired pizza oven."
      },
      {
        "step": 2,
        "title": "Shape the Dough",
        "text": "Let your dough come to room temperature if it was refrigerated. Dust your work surface with flour and gently press the dough from the center outward, rotating as you go. Use your hands to stretch it, letting gravity help by draping it over your knuckles. Never use a rolling pin as this pushes out all the air bubbles that create a light, airy crust. Aim for about a 12 inch circle."
      },
      {
        "step": 3,
        "title": "Top Simply",
        "text": "Transfer the dough to a floured pizza peel or inverted baking sheet. Spread a thin layer of your tomato sauce, leaving about an inch border for the crust. Less is more here. Tear your fresh mozzarella into chunks and distribute evenly. Do not add the basil yet or it will burn. Drizzle with a little olive oil and season with a pinch of salt."
      },
      {
        "step": 4,
        "title": "Bake Until Perfect",
        "text": "Slide the pizza onto your hot stone or directly onto the oven rack. Bake for 10 to 12 minutes until the crust is golden and slightly charred in spots and the cheese is bubbly and beginning to brown. Every oven is different so keep an eye on it. Once out of the oven, immediately scatter fresh basil leaves over the top and add another drizzle of good olive oil. Let it rest for just a minute before slicing and serving."
      }
    ],
    "heritage": {
      "origin": "In 1889, pizzaiolo Raffaele Esposito created a pizza for Queen Margherita of Savoy using tomato, mozzarella, and basil to represent the Italian flag's colors. The queen declared it her favorite, and the dish became a symbol of Italian national identity, elevating peasant food to royal status.",
      "facts": [
        "Authentic San Marzano tomatoes, grown in volcanic soil near Mount Vesuvius and protected by EU designation, have a sweeter flavor and meatier texture than standard varieties.",
        "Fresh mozzarella must be used, either buffalo milk mozzarella di bufala or cow's milk fior di latte. Pre shredded industrial mozzarella has no place on a proper Margherita.",
        "Proper dough requires 24 to 72 hours of fermentation for complex flavor and relaxed gluten that stretches easily.",
        "A traditional Neapolitan oven reaches 900 degrees Fahrenheit, baking the pizza in just 60 to 90 seconds."
      ],
      "tradition": "The pizza must be stretched by hand, never rolled, to preserve the gas bubbles that create the charred, puffy cornicione edge. Add basil leaves after baking to keep them bright green and aromatic."
    },
    "extra": []
  },
  {
    "id": "13",
    "slug": "greek-gyro-recipe",
    "title": "Beef & Lamb Gyro Recipe",
    "summary": "A flavorful wrap with seasoned meat, pita, tomato, onion, and tzatziki.",
    "description": "A flavorful wrap with seasoned meat, pita, tomato, onion, and tzatziki.",
    "image": "https://images.unsplash.com/photo-1593504049359-74330189a345?q=80&w=600&h=400&fit=crop",
    "category": "Greek",
    "cuisine": "Greek",
    "continent": "Europe",
    "dietary": [],
    "mealType": "Lunch",
    "audience": [
      "Couples"
    ],
    "country": "Greece",
    "prepTime": "30 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.5,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Medium",
    "servings": 2,
    "totalCalories": 600,
    "ingredients": [
      {
        "name": "Pita Bread",
        "amount": "2",
        "calories": 330,
        "protein": "11g",
        "carbs": "66g",
        "fat": "3g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Gyro Meat",
        "amount": "200g",
        "calories": 450,
        "protein": "30g",
        "carbs": "4g",
        "fat": "35g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Tzatziki",
        "amount": "4 tbsp",
        "calories": 60,
        "protein": "3g",
        "carbs": "4g",
        "fat": "4g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Red Onion",
        "amount": "1/4",
        "calories": 15,
        "protein": "0g",
        "carbs": "4g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Cook the Gyro Meat",
        "text": "If using pre made gyro meat, slice it thin and cook in a hot skillet until the edges get crispy and caramelized. If making from scratch, season your ground lamb and beef mixture with oregano, thyme, garlic, cumin, and paprika. Form into a loaf, bake until cooked through, then slice thin and crisp in a pan. The crispy edges are essential for authentic flavor."
      },
      {
        "step": 2,
        "title": "Warm the Pita",
        "text": "Heat a dry skillet over medium high heat. Warm each pita for about 30 seconds per side until soft and pliable with a few light char marks. You can also wrap them in foil and warm in the oven, or hold them briefly over an open gas flame if you want that authentic charred flavor. Keep them wrapped in a clean towel to stay warm and soft."
      },
      {
        "step": 3,
        "title": "Prep Your Toppings",
        "text": "Thinly slice your red onion and ripe tomatoes. Shred some crisp lettuce if you like. Make sure your tzatziki is ready, thick and creamy with visible bits of cucumber and a good garlicky punch. Some people like to add french fries directly into their gyro for extra substance, which is very traditional in Greece."
      },
      {
        "step": 4,
        "title": "Build and Serve",
        "text": "Lay your warm pita flat and spread a generous amount of tzatziki down the center. Pile on the hot, crispy gyro meat. Add your tomatoes, onion, and lettuce. Drizzle more tzatziki over the top. Fold the sides over the filling and wrap in parchment paper or foil to hold it together. Eat immediately while everything is still warm, letting the cool sauce contrast with the hot spiced meat."
      }
    ],
    "heritage": {
      "origin": "The gyro developed in Athens in the 1920s when Greek refugees from Constantinople adapted Turkish doner kebab with Mediterranean herbs like oregano, thyme, and rosemary. The word 'gyro' simply means 'turn' in Greek, referring to the rotating vertical spit.",
      "facts": [
        "The vertical spit allows fat to continuously baste the meat as it rotates, creating a crispy outer crust while keeping the interior juicy.",
        "In authentic Greek shops, french fries go directly into the wrap, absorbing meat juices and adding substance.",
        "Proper tzatziki requires straining both yogurt and grated cucumber to remove excess moisture, preventing a soggy pita.",
        "The meat should be sliced thin and served immediately while still hot from the spit."
      ],
      "tradition": "A proper gyro follows a specific order: warmed pita, hot meat, sliced tomatoes, raw onion, and a generous drizzle of cool tzatziki. Meant to be eaten standing or walking through busy Greek streets."
    },
    "extra": []
  },
  {
    "id": "14",
    "slug": "miso-glazed-eggplant-recipe",
    "title": "Miso Eggplant Recipe",
    "summary": "A delicious Japanese side dish featuring eggplant glazed with sweet and salty miso.",
    "description": "A delicious Japanese side dish featuring eggplant glazed with sweet and salty miso.",
    "image": "https://images.unsplash.com/photo-1534422298391-e4f8c172dddb?q=80&w=600&h=400&fit=crop",
    "category": "Japanese",
    "cuisine": "Japanese",
    "continent": "Asia",
    "dietary": [
      "Vegan",
      "Gluten Free"
    ],
    "mealType": "Lunch",
    "audience": [
      "Health Conscious"
    ],
    "country": "Japan",
    "prepTime": "25 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.6,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Easy",
    "servings": 2,
    "totalCalories": 180,
    "ingredients": [
      {
        "name": "Eggplant",
        "amount": "2 medium",
        "calories": 70,
        "protein": "2g",
        "carbs": "16g",
        "fat": "0.5g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Miso Paste",
        "amount": "2 tbsp",
        "calories": 60,
        "protein": "4g",
        "carbs": "8g",
        "fat": "2g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Mirin",
        "amount": "1 tbsp",
        "calories": 40,
        "protein": "0g",
        "carbs": "10g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Sesame Seeds",
        "amount": "1 tsp",
        "calories": 20,
        "protein": "1g",
        "carbs": "1g",
        "fat": "2g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Prepare the Eggplant",
        "text": "Cut your eggplants in half lengthwise. Score the flesh in a crosshatch pattern, cutting about half an inch deep but not through the skin. This allows the glaze to penetrate and helps the eggplant cook evenly. Brush the cut sides lightly with oil to prevent them from drying out during the initial cooking."
      },
      {
        "step": 2,
        "title": "Make the Miso Glaze",
        "text": "In a small saucepan, combine the white miso paste, mirin, a tablespoon of sugar, and a splash of sake if you have it. Warm over low heat, stirring constantly until the sugar dissolves and everything combines into a smooth, glossy paste. It should be thick enough to coat the back of a spoon but still spreadable. Taste and adjust sweetness if needed."
      },
      {
        "step": 3,
        "title": "Pre cook the Eggplant",
        "text": "Preheat your broiler to high. Place the eggplant halves cut side down on a lined baking sheet. Broil for about 5 to 7 minutes until the flesh starts to soften. You want them tender but not fully cooked yet since they will go back under the broiler. Flip them over so the scored flesh faces up."
      },
      {
        "step": 4,
        "title": "Glaze and Finish",
        "text": "Spread the miso glaze generously over the scored flesh of each eggplant half. Return to the broiler and cook for another 3 to 5 minutes, watching carefully. The glaze should bubble and caramelize, developing deep golden brown patches. The eggplant flesh should be completely soft and almost creamy. Sprinkle with toasted sesame seeds and serve immediately while still hot."
      }
    ],
    "heritage": {
      "origin": "Called nasu dengaku in Japanese, this dish dates to the 14th century Muromachi period. The name references a folk dance where rice planters balanced on stilts, which the skewered eggplants were thought to resemble. Buddhist temple cooking, called shojin ryori, elevated this vegetable preparation to an art form.",
      "facts": [
        "Scoring the eggplant flesh in a crosshatch pattern allows the glaze to penetrate deeply while creating an attractive presentation.",
        "Japanese eggplants are smaller and more tender than Western globe varieties, with thinner skins and fewer bitter seeds.",
        "The miso glaze combines white miso, sugar, mirin, and sake, cooked until thick enough to coat a spoon without running.",
        "Kyoto's prized Kamo nasu eggplant, round and nearly seedless, is considered the finest variety for dengaku."
      ],
      "tradition": "Cook the eggplant until the flesh becomes impossibly creamy, then broil until the miso glaze bubbles and develops golden brown caramelized patches. Finish with toasted sesame seeds and optional shichimi togarashi."
    },
    "extra": []
  },
  {
    "id": "paneer-paratha-001",
    "slug": "paneer-paratha-recipe",
    "title": "Paneer Paratha Recipe",
    "summary": "A flavorful Indian stuffed flatbread filled with spiced paneer cheese.",
    "description": "Soft wholewheat flatbreads stuffed with a warm, spiced paneer filling  perfect for breakfast, lunch, or dinner. Crispy on the outside and tender inside, these parathas bring comfort and spice together.",
    "image": "/Paneer-Paratha.jpeg",
    "category": "Indian",
    "cuisine": "North Indian",
    "continent": "Asia",
    "dietary": [
      "Vegetarian"
    ],
    "mealType": "Breakfast/Lunch",
    "audience": [
      "Families",
      "Vegetarian"
    ],
    "country": "India",
    "prepTime": "35 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 5,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Medium",
    "servings": 2,
    "totalCalories": 820,
    "ingredients": [
      {
        "name": "Whole wheat flour",
        "amount": "1.5 cups",
        "calories": 570,
        "protein": "18g",
        "carbs": "120g",
        "fat": "3g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Grated paneer",
        "amount": "1 cup",
        "calories": 260,
        "protein": "14g",
        "carbs": "6g",
        "fat": "20g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Green chili",
        "amount": "1 finely chopped",
        "calories": 4,
        "protein": "0.2g",
        "carbs": "1g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Cilantro (chopped)",
        "amount": "2 tbsp",
        "calories": 1,
        "protein": "0.1g",
        "carbs": "0.2g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Red chili powder",
        "amount": "1/2 tsp",
        "calories": 4,
        "protein": "0.2g",
        "carbs": "0.8g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Salt",
        "amount": "to taste",
        "calories": 0,
        "protein": "0g",
        "carbs": "0g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Ghee or oil",
        "amount": "2 tbsp",
        "calories": 80,
        "protein": "0g",
        "carbs": "0g",
        "fat": "9g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Make the Dough",
        "text": "Add the whole wheat flour to a large mixing bowl with a pinch of salt. Slowly add warm water while mixing with your other hand. Knead for about 8 to 10 minutes until you have a soft, smooth dough that springs back when pressed. Add a teaspoon of oil and knead a bit more. Cover with a damp cloth and let it rest for at least 20 minutes."
      },
      {
        "step": 2,
        "title": "Prepare the Filling",
        "text": "While the dough rests, grate or crumble your fresh paneer into a bowl. Add the finely chopped green chili, fresh cilantro, red chili powder, a pinch of cumin if you like, and salt to taste. Mix everything together gently with your hands. The filling should be flavorful but not wet. If your paneer is moist, squeeze out excess liquid."
      },
      {
        "step": 3,
        "title": "Assemble the Parathas",
        "text": "Divide the dough into equal portions, about the size of a golf ball. Roll each ball into a small circle. Place a generous spoonful of filling in the center. Bring the edges together and pinch to seal like a dumpling. Flatten gently with your palm, then roll out carefully into a 6 to 7 inch circle. Do not press too hard or the filling will break through."
      },
      {
        "step": 4,
        "title": "Cook Until Golden",
        "text": "Heat a tava or cast iron skillet over medium heat. Place the paratha on the dry hot surface. Cook until you see small bubbles forming, about a minute. Flip and brush the cooked side with ghee or oil. Cook the second side until golden spots appear, then flip again and brush with more ghee. Press gently with a spatula to ensure even cooking. Serve immediately while hot and crispy with yogurt and pickle on the side."
      }
    ],
    "heritage": {
      "origin": "Paneer paratha originated in Punjab, North India, where wheat flatbreads form the foundation of every meal. Families would gather around the tava, the heavy flat griddle essential to Indian bread making, passing techniques through generations during winter months when fresh paneer was plentiful.",
      "facts": [
        "The dough must rest before rolling to allow gluten to relax. Too stiff and it cracks; too soft and it sticks to the rolling surface.",
        "Fresh paneer should be crumbly, not the rubbery pressed variety found in Western supermarkets. Grate or mash it for the filling.",
        "Roll gently with light pressure to spread the filling evenly without pushing it through the surface of the dough.",
        "Chaat masala in the filling adds a distinctive tangy punch that elevates the dish beyond simple spiced cheese."
      ],
      "tradition": "Serve hot from the griddle with cool yogurt, tangy pickle, and a pat of butter melting on top. The contrast of temperatures and flavors is essential to the experience."
    },
    "extra": []
  },
  {
    "id": "gobi-paratha-001",
    "slug": "gobi-paratha-recipe",
    "title": "Gobi Paratha Recipe",
    "summary": "Classic North Indian stuffed flatbread with spiced grated cauliflower filling.",
    "description": "Soft whole-wheat parathas generously stuffed with a flavorful, mildly spiced grated cauliflower (gobi) mixture  crispy golden outside with a tender, aromatic filling inside.",
    "image": "/gobi-paratha.jpeg",
    "category": "Indian",
    "cuisine": "North Indian",
    "continent": "Asia",
    "dietary": [
      "Vegetarian"
    ],
    "mealType": "Breakfast/Lunch/Dinner",
    "audience": [
      "Families",
      "Vegetarian"
    ],
    "country": "India",
    "prepTime": "40 mins",
    "cookTime": null,
    "totalTime": null,
    "rating": 4.9,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Medium",
    "servings": 4,
    "totalCalories": 780,
    "ingredients": [
      {
        "name": "Whole wheat flour",
        "amount": "2 cups",
        "calories": 760,
        "protein": "24g",
        "carbs": "160g",
        "fat": "4g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Grated cauliflower (gobi)",
        "amount": "2 cups (about 1 medium head)",
        "calories": 50,
        "protein": "4g",
        "carbs": "10g",
        "fat": "0.5g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Green chili",
        "amount": "2 finely chopped",
        "calories": 8,
        "protein": "0.4g",
        "carbs": "2g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Ginger",
        "amount": "1 tsp grated",
        "calories": 5,
        "protein": "0.1g",
        "carbs": "1g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Cumin seeds",
        "amount": "1 tsp",
        "calories": 8,
        "protein": "0.4g",
        "carbs": "1g",
        "fat": "0.5g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Garam masala",
        "amount": "1/2 tsp",
        "calories": 5,
        "protein": "0.2g",
        "carbs": "1g",
        "fat": "0.2g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Red chili powder",
        "amount": "1/2 tsp",
        "calories": 4,
        "protein": "0.2g",
        "carbs": "0.8g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Fresh cilantro",
        "amount": "3 tbsp chopped",
        "calories": 2,
        "protein": "0.2g",
        "carbs": "0.4g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Salt",
        "amount": "to taste",
        "calories": 0,
        "protein": "0g",
        "carbs": "0g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Ghee or oil",
        "amount": "34 tbsp (for cooking)",
        "calories": 360,
        "protein": "0g",
        "carbs": "0g",
        "fat": "40g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Knead the Dough",
        "text": "Combine the whole wheat flour with a pinch of salt in a large bowl. Gradually add water while mixing until a shaggy dough forms. Knead for 8 to 10 minutes until smooth and soft. It should not be sticky but should spring back when pressed. Add a drizzle of oil and knead briefly. Cover with a damp cloth and rest for at least 20 minutes while you prepare the filling."
      },
      {
        "step": 2,
        "title": "Make the Cauliflower Filling",
        "text": "Grate the cauliflower using the fine holes of a box grater. This is important because large pieces will tear the dough when rolling. Place the grated cauliflower in a clean kitchen towel and squeeze out every drop of moisture you can. This step is crucial. Mix the dry cauliflower with green chili, grated ginger, cumin seeds, garam masala, fresh cilantro, and salt. Do not add salt until ready to use as it draws out moisture."
      },
      {
        "step": 3,
        "title": "Stuff and Roll",
        "text": "Divide the dough into equal balls, about the size of a lime. Roll one ball into a small circle. Place a generous amount of filling in the center. Bring the edges up and pinch together to seal. Gently flatten the stuffed ball with your palm, then carefully roll it out into a 7 to 8 inch circle. Use a light touch and dust with flour if it sticks. If the filling pokes through, patch it with a bit of dough."
      },
      {
        "step": 4,
        "title": "Cook to Golden Perfection",
        "text": "Heat a tava or heavy skillet over medium high heat. Place the paratha on the hot surface. When you see small bubbles and the underside has light brown spots, flip it over. Spread ghee or oil on the cooked side. Flip again after a minute and spread ghee on the second side. Press the edges gently with a spatula to ensure they cook through. The paratha is ready when both sides have beautiful golden brown spots. Serve immediately with yogurt, butter, and pickle."
      }
    ],
    "heritage": {
      "origin": "Gobi paratha emerged from Punjab and Uttar Pradesh kitchens where resourceful cooks stuffed flatbreads with seasonal vegetables. Cauliflower became popular during winter months when it floods Indian markets at peak freshness. Women would wake before dawn to prepare these parathas for family breakfast.",
      "facts": [
        "The cauliflower must be grated finely and thoroughly squeezed to remove moisture. Too much liquid makes the dough soggy and heavy.",
        "Anardana, dried pomegranate seeds, adds a subtle tartness that cuts through the richness. This is a traditional Punjabi touch.",
        "The cauliflower becomes almost sweet as it cooks within the bread, its natural sugars concentrating while the spices meld.",
        "Avoid adding salt to the cauliflower until ready to stuff. Salt releases moisture that can make the paratha soggy."
      ],
      "tradition": "Serve with homemade white butter called makhan, tangy mango pickle, and thick yogurt. Found everywhere from roadside dhabas along the Grand Trunk Road to upscale restaurants in Delhi."
    },
    "extra": [
      "Avoid adding salt to the cauliflower until you are ready to stuff; salt releases moisture and can make the paratha soggy.",
      "Grate the cauliflower finely  large chunks can tear the dough during rolling.",
      "If the dough feels too tight, add a teaspoon of oil while kneading for extra elasticity."
    ]
  },
  {
    "id": "garlic-cheese-sandwich-001",
    "slug": "garlic-cheese-sandwich-recipe",
    "title": "Garlic Cheese Sandwich",
    "summary": "Crispy toasted bread slathered with garlic butter and stuffed with gooey melted cheese  ultimate comfort food in sandwich form.",
    "description": "Golden, buttery bread infused with fresh garlic aroma and loaded with perfectly melted cheese. Simple, indulgent, and ready in under 15 minutes  the perfect quick snack, lunch, or midnight craving fix.",
    "image": "/garlic-cheese-sandwich.jpeg",
    "category": "Quick Bites",
    "cuisine": "Fusion / Modern",
    "continent": "Global",
    "dietary": [
      "Vegetarian"
    ],
    "mealType": "Snack/Lunch/Breakfast",
    "audience": [
      "Quick Meals",
      "Comfort Food Lovers",
      "Kids"
    ],
    "country": "Global",
    "prepTime": "5 mins",
    "cookTime": "8 mins",
    "totalTime": "13 mins",
    "rating": 4.8,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Easy",
    "servings": 2,
    "totalCalories": 680,
    "ingredients": [
      {
        "name": "Bread slices (white or sourdough)",
        "amount": "4 thick slices",
        "calories": 320,
        "protein": "12g",
        "carbs": "60g",
        "fat": "4g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Cheddar or mozzarella cheese (grated)",
        "amount": "1.5 cups (about 150g)",
        "calories": 600,
        "protein": "36g",
        "carbs": "6g",
        "fat": "48g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Butter (softened)",
        "amount": "3 tbsp",
        "calories": 300,
        "protein": "0g",
        "carbs": "0g",
        "fat": "33g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Garlic cloves",
        "amount": "45 (finely minced or grated)",
        "calories": 20,
        "protein": "1g",
        "carbs": "5g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Fresh parsley (optional)",
        "amount": "1 tbsp finely chopped",
        "calories": 1,
        "protein": "0.1g",
        "carbs": "0.2g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Salt",
        "amount": "pinch",
        "calories": 0,
        "protein": "0g",
        "carbs": "0g",
        "fat": "0g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Make the Garlic Butter",
        "text": "Let your butter soften at room temperature until it is easily spreadable. Mince your garlic very finely or grate it on a microplane. Mix the garlic into the butter along with a pinch of salt and some chopped parsley if you have it. Mash everything together until the garlic is evenly distributed throughout. You can make this ahead and refrigerate it, but let it soften again before using."
      },
      {
        "step": 2,
        "title": "Prep Your Sandwiches",
        "text": "Spread a generous layer of the garlic butter on one side of each bread slice, going all the way to the edges. You want enough that the bread will get crispy and aromatic but not so much that it pools in the pan. Grate your cheese if it is not already grated. A mix of cheddar for flavor and mozzarella for stretch works beautifully."
      },
      {
        "step": 3,
        "title": "Assemble and Cook",
        "text": "Place two bread slices butter side down in a cold pan. Pile a generous amount of grated cheese on each one, really heap it on. Top with the remaining bread slices, butter side up. Turn the heat to medium low. Cook slowly and patiently for 3 to 4 minutes per side. The low heat is important because you want the cheese to melt completely before the bread burns."
      },
      {
        "step": 4,
        "title": "Finish and Serve",
        "text": "When the first side is deep golden brown and crispy, carefully flip the sandwich using a spatula. Press down gently to help the cheese make contact with both pieces of bread. Cook the second side until equally golden. The cheese should be completely melted and starting to ooze out the sides. Cut diagonally for the best presentation, letting that cheese stretch and pull. Serve immediately while hot and gooey."
      }
    ],
    "heritage": {
      "origin": "Grilled cheese dates to ancient Rome, but the modern version emerged in 1920s America when processed cheese and sliced bread became affordable. Adding garlic butter draws inspiration from Italian American garlic bread, combining two beloved comfort foods into one aromatic creation.",
      "facts": [
        "Make the garlic butter ahead and let it rest so the flavor can permeate throughout. Fresh garlic releases volatile aromatics when heated.",
        "Use medium or medium low heat, not high. Slower cooking allows the cheese to melt completely before the bread burns.",
        "Blend cheeses for best results: cheddar for sharp flavor, mozzarella for stretch, and American for creamy melt.",
        "Press down lightly with a spatula to ensure good contact between bread and pan, promoting even golden browning."
      ],
      "tradition": "Serve with tomato soup for the classic American pairing. The sweet acidity of the soup cuts through the rich, garlicky cheese, creating perfect balance in every dip."
    },
    "extra": [
      "For extra indulgence, add a sprinkle of chili flakes or oregano to the garlic butter.",
      "Use a mix of cheeses (cheddar + mozzarella) for the perfect melt and flavor balance.",
      "Cook on medium-low heat to ensure cheese melts fully without burning the bread."
    ]
  },
  {
    "id": "chickpea-shawarma-wrap-001",
    "slug": "chickpea-shawarma-wrap-recipe",
    "title": "Vegan Chickpea Shawarma Wrap",
    "summary": "Spiced roasted chickpeas wrapped in warm pita with tahini sauce, fresh veggies and pickles  Middle Eastern street food vibes, completely plant-based.",
    "description": "Crispy, warmly spiced chickpeas stand in beautifully for traditional meat in this satisfying wrap. Paired with creamy tahini sauce, crunchy vegetables, and tangy pickles  it's fresh, flavorful, and deeply comforting.",
    "image": "/Vegan-Chickpea-Shawarma-Wrap.png",
    "category": "Wraps",
    "cuisine": "Middle Eastern",
    "continent": "Asia",
    "dietary": [
      "Vegan",
      "Gluten Free Optional"
    ],
    "mealType": "Lunch/Dinner",
    "audience": [
      "Healthy",
      "Quick Meals",
      "Street Food Lovers"
    ],
    "country": "Global",
    "prepTime": "15 mins",
    "cookTime": "25 mins",
    "totalTime": "40 mins",
    "rating": 4.9,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Easy",
    "servings": 4,
    "totalCalories": 520,
    "ingredients": [
      {
        "name": "Canned chickpeas",
        "amount": "2  400g cans (drained)",
        "calories": 480,
        "protein": "26g",
        "carbs": "80g",
        "fat": "8g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Olive oil",
        "amount": "3 tbsp",
        "calories": 360,
        "protein": "0g",
        "carbs": "0g",
        "fat": "40g",
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Shawarma spice blend (or cumin + coriander + paprika + garlic powder + cinnamon + cayenne)",
        "amount": "2 tbsp",
        "calories": 40,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Pita breads (or flatbreads)",
        "amount": "4 large",
        "calories": 680,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Tahini",
        "amount": "4 tbsp",
        "calories": 360,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Lemon juice",
        "amount": "2 tbsp",
        "calories": 10,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Cucumber, tomato, red onion, pickles, fresh parsley",
        "amount": "as desired",
        "calories": 80,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Season and Roast the Chickpeas",
        "text": "Drain and rinse your chickpeas, then spread them on a clean kitchen towel and pat completely dry. This step is crucial for getting them crispy. Toss them with olive oil and your shawarma spice blend which includes cumin, coriander, paprika, turmeric, and a pinch of cinnamon. Spread in a single layer on a baking sheet and roast at 400 degrees Fahrenheit for 25 to 30 minutes, shaking the pan halfway through, until golden and crispy on the outside."
      },
      {
        "step": 2,
        "title": "Make the Tahini Sauce",
        "text": "While the chickpeas roast, prepare your tahini sauce. In a small bowl, whisk together the tahini paste with fresh lemon juice and cold water. Add water gradually until you reach a pourable consistency, like heavy cream. Season with salt and garlic if you like. The sauce should be creamy and bright. If it thickens too much as it sits, just whisk in a bit more water."
      },
      {
        "step": 3,
        "title": "Prep Your Vegetables",
        "text": "Dice your cucumbers and tomatoes into small pieces. Thinly slice the red onion. Roughly chop fresh parsley and mint. If using pickles or pickled turnips, have those ready too. The combination of fresh crunchy vegetables with the warm spiced chickpeas is what makes this wrap so satisfying, so do not skip the fresh elements."
      },
      {
        "step": 4,
        "title": "Warm and Assemble",
        "text": "Warm your pita breads in a dry skillet or briefly in the oven until soft and pliable. Spread a generous amount of tahini sauce down the center of each pita. Add a big scoop of the hot crispy chickpeas. Top with the fresh vegetables, pickles, and herbs. Drizzle with more tahini sauce. Roll everything up tightly, tucking in the bottom as you go. Wrap in foil or parchment if eating on the go. Serve immediately while the chickpeas are still warm and crunchy."
      }
    ],
    "heritage": {
      "origin": "Traditional shawarma has ancient roots in the Levant, where cooks roasted spiced meat on rotating vertical spits. The word comes from Turkish 'cevirme' meaning turning. Chickpeas, cultivated in the Middle East for over 7,500 years, provide the perfect plant based base for this vegan adaptation.",
      "facts": [
        "Chickpeas must be thoroughly dried before roasting. Excess moisture causes steaming rather than the crispy exterior you want.",
        "The shawarma spice blend combines cumin, coriander, paprika, turmeric, and cinnamon, sometimes with allspice or cardamom.",
        "Spread tahini inside the wrap first to create a barrier that prevents sogginess from the vegetables.",
        "Pickled turnips, that shocking pink Levantine condiment, add tangy acidity that cuts through the richness."
      ],
      "tradition": "Assembly follows a specific order: tahini sauce first, then warm spiced chickpeas, fresh vegetables and pickles, and a final drizzle of sauce. Warm the pita just before assembling so it stays pliable."
    },
    "extra": [
      "For extra crunch, add quick-pickled red cabbage or turnips.",
      "Make it gluten-free with gluten-free flatbreads or lettuce wraps."
    ]
  },
  {
    "id": "mushroom-stroganoff-001",
    "slug": "creamy-mushroom-stroganoff-recipe",
    "title": "Creamy Vegan Mushroom Stroganoff",
    "summary": "Rich, silky mushroom sauce over pasta  classic comfort food made completely dairy-free.",
    "description": "Tender mushrooms in a luscious, tangy cashew-based cream sauce with hints of mustard and paprika  served over wide noodles for the ultimate cozy dinner.",
    "image": "/Creamy-Vegan-Mushroom-Stroganoff.png",
    "category": "Pasta",
    "cuisine": "Russian / Fusion",
    "continent": "Europe",
    "dietary": [
      "Vegan"
    ],
    "mealType": "Dinner",
    "audience": [
      "Comfort Food",
      "Date Night"
    ],
    "country": "Global",
    "prepTime": "15 mins",
    "cookTime": "20 mins",
    "totalTime": "35 mins",
    "rating": 4.8,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Medium",
    "servings": 4,
    "totalCalories": 580,
    "ingredients": [
      {
        "name": "Chestnut/brown mushrooms",
        "amount": "600g, sliced",
        "calories": 130,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Cashews (soaked)",
        "amount": "1 cup (soaked 4+ hours)",
        "calories": 780,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Tagliatelle or fettuccine (egg-free)",
        "amount": "300g dry",
        "calories": 1050,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Onion",
        "amount": "1 large, finely sliced",
        "calories": 60,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Garlic",
        "amount": "4 cloves, minced",
        "calories": 20,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Dijon mustard",
        "amount": "1 tbsp",
        "calories": 15,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Smoked paprika",
        "amount": "1 tsp",
        "calories": null,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Fresh parsley",
        "amount": "handful, chopped",
        "calories": null,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Cook Your Pasta to Al Dente",
        "text": "Bring a large pot of water to a rolling boil and add a generous pinch of salt. Cook your pasta according to package directions, but pull it about a minute early so it finishes cooking in the sauce. Before draining, reserve a full cup of that starchy pasta water because this liquid gold helps your sauce come together beautifully and cling to every strand."
      },
      {
        "step": 2,
        "title": "Saut the Mushrooms Until Golden",
        "text": "Heat olive oil in a large skillet over medium high heat. Add your sliced mushrooms in a single layer without crowding them, otherwise they steam instead of browning. Let them sit undisturbed for about 3 minutes until golden on the bottom, then stir and continue cooking. Once they release their liquid, add the diced onion and cook until everything turns beautifully caramelized, about 8 to 10 minutes total. Season with salt and pepper as you go."
      },
      {
        "step": 3,
        "title": "Blend the Cashew Cream",
        "text": "While the mushrooms cook, add your soaked cashews to a blender along with one and a half cups of fresh water. Add a teaspoon of Dijon mustard for that classic stroganoff tang, a generous pinch of smoked paprika, one clove of garlic, and salt and pepper to taste. Blend on high for a full minute until completely smooth and silky. You want zero grittiness here."
      },
      {
        "step": 4,
        "title": "Bring It All Together",
        "text": "Pour the cashew cream directly into the skillet with your golden mushrooms and stir to combine. Let this simmer gently for 3 to 5 minutes, stirring occasionally, until the sauce thickens and the flavors meld together. If the sauce gets too thick, add splashes of that reserved pasta water until you reach your desired consistency. Taste and adjust the seasoning now."
      },
      {
        "step": 5,
        "title": "Finish and Serve",
        "text": "Add the drained pasta directly to the skillet and toss everything together over low heat for another minute so the pasta absorbs some of that gorgeous sauce. Plate immediately and garnish generously with freshly chopped parsley. A final crack of black pepper on top adds a nice finishing touch. Serve right away while the sauce is still glossy and clinging to the noodles."
      }
    ],
    "heritage": {
      "origin": "Stroganoff emerged from 19th century Russian aristocracy, named after Count Pavel Stroganov whose lavish dinner parties made the dish famous. It appears in Russian cookbooks from the 1870s and spread worldwide. This vegan version uses mushrooms for umami and cashew cream for richness.",
      "facts": [
        "Mushrooms must be sauteed in batches with space in the pan. Crowding causes steaming rather than browning, and browning is essential.",
        "The Maillard reaction when mushrooms caramelize creates complex savory flavors that cannot be achieved any other way.",
        "Dijon mustard in the cashew cream provides the characteristic tang of traditional sour cream based stroganoff.",
        "Raw cashews, soaked and blended with water, transform into a neutral cream that takes on whatever seasonings you add."
      ],
      "tradition": "Serve over wide egg noodles, or rice and mashed potatoes for a neutral background. Garnish generously with fresh parsley and a crack of black pepper just before serving."
    },
    "extra": [
      "Add a splash of white wine or soy sauce for extra umami.",
      "Use oyster or king oyster mushrooms for even meatier texture."
    ]
  },
  {
    "id": "lentil-bolognese-001",
    "slug": "hearty-lentil-bolognese-recipe",
    "title": "Vegan Lentil Bolognese",
    "summary": "Rich, meaty lentil rag simmered with tomatoes and herbs  perfect over pasta or polenta.",
    "description": "Deeply savory, slow-simmered sauce packed with lentils, vegetables, red wine, and tomatoes. Tastes like its been cooking all day  but ready in under an hour.",
    "image": "/Vegan-Lentil-Bolognese.png",
    "category": "Pasta",
    "cuisine": "Italian",
    "continent": "Europe",
    "dietary": [
      "Vegan"
    ],
    "mealType": "Dinner",
    "audience": [
      "Families",
      "Meal Prep"
    ],
    "country": "Italy / Global",
    "prepTime": "15 mins",
    "cookTime": "40 mins",
    "totalTime": "55 mins",
    "rating": 4.9,
    "ratingCount": 0,
    "reviewCount": 0,
    "difficulty": "Medium",
    "servings": 6,
    "totalCalories": 480,
    "ingredients": [
      {
        "name": "Green or brown lentils (dry)",
        "amount": "1.5 cups",
        "calories": 1010,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Crushed tomatoes",
        "amount": "800g can",
        "calories": 280,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Red wine (optional but recommended)",
        "amount": "150ml",
        "calories": 120,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Onion, carrot, celery",
        "amount": "1 each, finely chopped",
        "calories": 120,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Garlic",
        "amount": "4 cloves",
        "calories": null,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      },
      {
        "name": "Fresh basil + oregano",
        "amount": "to taste",
        "calories": null,
        "protein": null,
        "carbs": null,
        "fat": null,
        "fiber": "0g",
        "sugar": "0g",
        "sodium": "0mg"
      }
    ],
    "instructions": [
      {
        "step": 1,
        "title": "Build Your Soffritto Base",
        "text": "Finely dice your onion, carrot, and celery into tiny uniform pieces, almost a paste consistency. Heat olive oil in a large heavy bottomed pot over medium heat and add all the vegetables along with the minced garlic. Cook gently, stirring occasionally, for about 8 minutes until everything softens, sweetens, and turns slightly golden. This aromatic base is the foundation of your entire sauce, so take your time here."
      },
      {
        "step": 2,
        "title": "Add Lentils and Build the Flavor",
        "text": "Pour in your red wine and let it bubble away for about 2 minutes until most of the liquid has evaporated and you are left with concentrated flavor. Add the dried lentils, crushed tomatoes, dried oregano, thyme, and a bay leaf. Give everything a good stir and season generously with salt and pepper. The lentils will absorb a lot of seasoning as they cook, so do not be shy here."
      },
      {
        "step": 3,
        "title": "Simmer Low and Slow",
        "text": "Add about 3 cups of water or vegetable stock to the pot, just enough to cover the lentils by about an inch. Bring to a gentle simmer, then reduce the heat to low, cover with a lid slightly ajar, and let it cook for 35 to 45 minutes. Stir every 10 minutes or so and add more liquid if things get too thick. The sauce is ready when the lentils are tender and the whole thing has reduced to a rich, thick consistency."
      },
      {
        "step": 4,
        "title": "Serve Over Pasta",
        "text": "Taste your sauce and adjust the seasoning one final time. Remove the bay leaf. Serve ladled generously over al dente pasta, creamy polenta, or spiralized zucchini noodles if you prefer something lighter. Finish each plate with torn fresh basil leaves and a drizzle of your best olive oil. This sauce tastes even better the next day, so make extra and thank yourself later."
      }
    ],
    "heritage": {
      "origin": "Bolognese hails from Bologna in Italy's Emilia Romagna region, prepared since the late 18th century. Traditional versions use ground beef and pork with soffritto, wine, and tomatoes. This lentil version honors the slow cooked spirit while remaining entirely plant based.",
      "facts": [
        "The soffritto, finely chopped onion, carrot, and celery, should be cooked gently until the vegetables practically melt into the oil. This is the flavor foundation.",
        "Use brown or green lentils, not red. They hold their shape during 35 to 45 minutes of simmering rather than dissolving to mush.",
        "Red wine should be cooked down until most liquid evaporates, removing the raw alcohol taste while concentrating fruity, tannic flavor.",
        "The sauce tastes even better the next day, making it perfect for meal prep. Freeze extras in individual portions."
      ],
      "tradition": "Serve over sturdy pasta like rigatoni or pappardelle that can stand up to the hearty sauce. Add fresh basil at the very end to preserve its bright flavor and provide unmistakable Italian character."
    },
    "extra": [
      "Tastes even better the next day  perfect for meal prep.",
      "Freeze extras in portions for quick future meals."
    ]
  }
]